
#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция ПолучитьЗначениеНастройки(Идентификатор = "") Экспорт
	
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Реквизиты = Метаданные.Справочники.НастройкиДополнительные.Реквизиты;
	
	ИмяРеквизитаИдентификатора = Реквизиты.Идентификатор.Имя;
	Настройка = НайтиПоРеквизиту(ИмяРеквизитаИдентификатора, Идентификатор);
	Если Не ЗначениеЗаполнено(Настройка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИмяРеквизитаЗначение = Реквизиты.Значение.Имя;
	Значение = Настройка[ИмяРеквизитаЗначение];
	
	Возврат Значение;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#Область Инициализация

#КонецОбласти
